org/blog.org
#+title: Strayforge — Blog source
#+author: Strayforge
#+startup: overview
#+options: toc:nil

# This single Org file holds many posts, one per top-level heading.
# ox-hugo workflow:
#   - Each heading with an :EXPORT_FILE_NAME: property becomes a post.
#   - :EXPORT_HUGO_BUNDLE: makes it a Hugo page bundle (folder + index.md),
#     matching the layout of content/posts/hello-world/. The default Hugo
#     section is already "posts", so the bundle is just the slug (NOT
#     "posts/slug") -> content/posts/<slug>/index.md.
#
# Export keys (point inside a heading):
#   C-c C-e H H   export the current subtree (this one post)
#   C-c C-e H A   export ALL subtrees in this file at once
#
# Anything below that isn't a post heading (like these comments) is ignored.

* My First Org Post    :org_mode:setup:@meta:
:PROPERTIES:
:EXPORT_HUGO_BUNDLE: my-first-org-post
:EXPORT_FILE_NAME: index
:EXPORT_HUGO_DRAFT: true
:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :math true
:EXPORT_DATE: 2026-06-26
:EXPORT_HUGO_SUMMARY: Written in Emacs Org mode and exported to Hugo with ox-hugo.
:END:

This post is authored in =org/blog.org= and exported to
=content/posts/my-first-org-post/index.md= by ox-hugo. Flip
=:EXPORT_HUGO_DRAFT:= to =false= when it's ready to publish.

** Math (KaTeX)
I just want to add something here.
The =:math true= custom front matter above turns on KaTeX for this page.
Inline math like $e^{i\pi} + 1 = 0$ renders mid-sentence. Block math:

\begin{equation}
\hat{\beta} = (X^\top X)^{-1} X^\top y
\end{equation}

** Code

Org source blocks become fenced, syntax-highlighted code blocks:

#+begin_src python
def fib(n: int) -> int:
    a, b = 0, 1
    for _ in range(n):
        a, b = b, a + b
    return a

print([fib(i) for i in range(10)])
#+end_src

** Diagram (Mermaid)

Use a =mermaid= source block; Hugo/Blowfish renders it client-side:

#+begin_src mermaid
flowchart LR
    A[Write in Org] --> B[C-c C-e H H]
    B --> C[ox-hugo writes index.md]
    C --> D[Push to main]
    D --> E[Cloudflare build]
#+end_src

** Chart (Blowfish shortcode)

Hugo shortcodes must be passed through verbatim, so wrap them in an
=md= export block — ox-hugo emits the contents as-is:

#+begin_export md
{{< chart >}}
type: 'line',
data: {
  labels: ['Jan', 'Feb', 'Mar', 'Apr', 'May'],
  datasets: [{
    label: 'Commits',
    data: [12, 19, 7, 22, 30],
    borderColor: '#3b82f6',
    tension: 0.3
  }]
}
{{< /chart >}}
#+end_export

That's the full toolkit — duplicate this heading to start a new post.
